In [2]:
# 경고(warning) 비표시
import warnings
warnings.filterwarnings('ignore')

In [85]:
import pandas as pd
uselog = pd.read_csv('./sports_center_data/use_log.csv')
print(len(uselog))
uselog.head()

197428

            log_id customer_id     usedate
0  L00000049012330    AS009373  2018-04-01
1  L00000049012331    AS015315  2018-04-01
2  L00000049012332    AS040841  2018-04-01
3  L00000049012333    AS046594  2018-04-01
4  L00000049012334    AS073285  2018-04-01

In [4]:
type(uselog['usedate'])

pandas.core.series.Series

In [5]:
uselog['usedate'][0]

'2018-04-01'

In [6]:
type(uselog['usedate'][0])

str

In [7]:
customer = pd.read_csv('./sports_center_data/customer_master.csv')
print(len(customer))
customer.head()

4192

,customer_id,name,class,gender,start_date,end_date,campaign_id,is_deleted
0,OA832399,XXXX,C01,F,2015-05-01 00:00:00,NaN,CA1,0
1,PL270116,XXXXX,C01,M,2015-05-01 00:00:00,NaN,CA1,0
2,OA974876,XXXXX,C01,M,2015-05-01 00:00:00,NaN,CA1,0
3,HD024127,XXXXX,C01,F,2015-05-01 00:00:00,NaN,CA1,0
4,HD661448,XXXXX,C03,F,2015-05-01 00:00:00,NaN,CA1,0

In [8]:
class_master = pd.read_csv('./sports_center_data/class_master.csv')
print(len(class_master))
class_master.head()

3

  class class_name  price
0   C01       0_종일  10500
1   C02       1_주간   7500
2   C03       2_야간   6000

In [9]:
campaign_master = pd.read_csv('./sports_center_data/campaign_master.csv')
print(len(campaign_master))
campaign_master.head()

3

  campaign_id campaign_name
0         CA1          2_일반
1         CA2     0_입회비반액할인
2         CA3       1_입회비무료

In [10]:
customer_join = pd.merge(customer, class_master, on="class", how="left")
customer_join = pd.merge(customer_join, campaign_master, on="campaign_id", how="left")
customer_join.head()

,customer_id,name,class,gender,start_date,end_date,campaign_id,is_deleted,class_name,price,campaign_name
0,OA832399,XXXX,C01,F,2015-05-01 00:00:00,NaN,CA1,0,0_종일,10500,2_일반
1,PL270116,XXXXX,C01,M,2015-05-01 00:00:00,NaN,CA1,0,0_종일,10500,2_일반
2,OA974876,XXXXX,C01,M,2015-05-01 00:00:00,NaN,CA1,0,0_종일,10500,2_일반
3,HD024127,XXXXX,C01,F,2015-05-01 00:00:00,NaN,CA1,0,0_종일,10500,2_일반
4,HD661448,XXXXX,C03,F,2015-05-01 00:00:00,NaN,CA1,0,2_야간,6000,2_일반

In [11]:
print(len(customer))
print(len(customer_join))

4192
4192

In [12]:
customer_join.isnull().sum()

customer_id         0
name                0
class               0
gender              0
start_date          0
end_date         2842
campaign_id         0
is_deleted          0
class_name          0
price               0
campaign_name       0
dtype: int64

In [13]:
customer_join.groupby("class_name").count()["customer_id"]

class_name
0_종일    2045
1_주간    1019
2_야간    1128
Name: customer_id, dtype: int64

In [14]:
customer_join.groupby("campaign_name").count()["customer_id"]

campaign_name
0_입회비반액할인     650
1_입회비무료       492
2_일반         3050
Name: customer_id, dtype: int64

In [15]:
customer_join.groupby("gender").count()["customer_id"]

gender
F    1983
M    2209
Name: customer_id, dtype: int64

In [16]:
customer_join.groupby("is_deleted").count()["customer_id"]

is_deleted
0    2842
1    1350
Name: customer_id, dtype: int64

In [17]:
customer_join["start_date"]

0       2015-05-01 00:00:00
1       2015-05-01 00:00:00
2       2015-05-01 00:00:00
3       2015-05-01 00:00:00
4       2015-05-01 00:00:00
               ...
4187    2019-03-14 00:00:00
4188    2019-03-14 00:00:00
4189    2019-03-14 00:00:00
4190    2019-03-14 00:00:00
4191    2019-03-15 00:00:00
Name: start_date, Length: 4192, dtype: object

In [18]:
customer_join["start_date"] = pd.to_datetime(customer_join["start_date"])

In [19]:
customer_join["start_date"]

0      2015-05-01
1      2015-05-01
2      2015-05-01
3      2015-05-01
4      2015-05-01
          ...
4187   2019-03-14
4188   2019-03-14
4189   2019-03-14
4190   2019-03-14
4191   2019-03-15
Name: start_date, Length: 4192, dtype: datetime64[ns]

In [20]:
customer_start = customer_join.loc[customer_join["start_date"]>pd.to_datetime("20180401")]
print(len(customer_start))

1361

In [21]:
customer_join.head()

,customer_id,name,class,gender,start_date,end_date,campaign_id,is_deleted,class_name,price,campaign_name
0,OA832399,XXXX,C01,F,2015-05-01,NaN,CA1,0,0_종일,10500,2_일반
1,PL270116,XXXXX,C01,M,2015-05-01,NaN,CA1,0,0_종일,10500,2_일반
2,OA974876,XXXXX,C01,M,2015-05-01,NaN,CA1,0,0_종일,10500,2_일반
3,HD024127,XXXXX,C01,F,2015-05-01,NaN,CA1,0,0_종일,10500,2_일반
4,HD661448,XXXXX,C03,F,2015-05-01,NaN,CA1,0,2_야간,6000,2_일반

In [22]:
customer_join['end_date']

0       NaN
1       NaN
2       NaN
3       NaN
4       NaN
       ...
4187    NaN
4188    NaN
4189    NaN
4190    NaN
4191    NaN
Name: end_date, Length: 4192, dtype: object

In [23]:
customer_join['end_date'].unique()

array([nan, '2018-04-30 00:00:00', '2018-05-31 00:00:00',
       '2018-06-30 00:00:00', '2018-07-31 00:00:00',
       '2018-08-31 00:00:00', '2018-09-30 00:00:00',
       '2018-11-30 00:00:00', '2018-12-31 00:00:00',
       '2019-01-31 00:00:00', '2018-10-31 00:00:00',
       '2019-02-28 00:00:00', '2019-03-31 00:00:00'], dtype=object)

In [27]:
# help(customer_join['end_date'].value_counts)

In [26]:
customer_join['end_date'].value_counts(dropna=False)

end_date
NaN                    2842
2019-02-28 00:00:00     149
2019-01-31 00:00:00     129
2018-05-31 00:00:00     125
2018-04-30 00:00:00     121
2018-08-31 00:00:00     113
2018-12-31 00:00:00     111
2019-03-31 00:00:00     111
2018-06-30 00:00:00     106
2018-09-30 00:00:00     104
2018-07-31 00:00:00     102
2018-10-31 00:00:00      90
2018-11-30 00:00:00      89
Name: count, dtype: int64

In [28]:
customer_join["end_date"] = pd.to_datetime(customer_join["end_date"])

In [29]:
customer_join["end_date"]

0      NaT
1      NaT
2      NaT
3      NaT
4      NaT
        ..
4187   NaT
4188   NaT
4189   NaT
4190   NaT
4191   NaT
Name: end_date, Length: 4192, dtype: datetime64[ns]

In [ ]:
 # NaT를 체크하기 위해서는 isna()

In [38]:
customer_join['end_date'].isna().value_counts()

end_date
True     2842
False    1350
Name: count, dtype: int64

False

In [43]:
# 2019년 3월1일부터 3월 31일까지의 고객 조회

In [44]:
# 교재
# customer_newer = customer_join.loc[(customer_join["end_date"]>=pd.to_datetime("20190331"))|(customer_join["end_date"].isna())]

In [49]:
# 특정 시간 범위의 데이터 조회
start_time = pd.to_datetime('20190301')
end_time = pd.to_datetime('20190331')
time_filter = (customer_join['end_date'] >= start_time) & (customer_join['end_date'] <= end_time) |(customer_join["end_date"].isna())
customer_newer = customer_join[time_filter]

In [50]:
customer_newer

,customer_id,name,class,gender,start_date,end_date,campaign_id,is_deleted,class_name,price,campaign_name
0,OA832399,XXXX,C01,F,2015-05-01,NaT,CA1,0,0_종일,10500,2_일반
1,PL270116,XXXXX,C01,M,2015-05-01,NaT,CA1,0,0_종일,10500,2_일반
2,OA974876,XXXXX,C01,M,2015-05-01,NaT,CA1,0,0_종일,10500,2_일반
3,HD024127,XXXXX,C01,F,2015-05-01,NaT,CA1,0,0_종일,10500,2_일반
4,HD661448,XXXXX,C03,F,2015-05-01,NaT,CA1,0,2_야간,6000,2_일반
...,...,...,...,...,...,...,...,...,...,...,...
4187,HD676663,XXXX,C01,M,2019-03-14,NaT,CA1,0,0_종일,10500,2_일반
4188,HD246549,XXXXX,C01,F,2019-03-14,NaT,CA1,0,0_종일,10500,2_일반
4189,GD037007,XXXXX,C03,M,2019-03-14,NaT,CA1,0,2_야간,6000,2_일반
4190,OA953150,XXXXX,C01,M,2019-03-14,NaT,CA1,0,0_종일,10500,2_일반
4191,IK692635,XXXXX,C02,F,2019-03-15,NaT,CA1,0,1_주간,7500,2_일반

In [51]:
print(len(customer_newer))

2953

In [52]:
customer_newer["end_date"].unique()

<DatetimeArray>
['NaT', '2019-03-31 00:00:00']
Length: 2, dtype: datetime64[ns]

In [53]:
customer_newer.groupby("class_name").count()["customer_id"]

class_name
0_종일    1444
1_주간     696
2_야간     813
Name: customer_id, dtype: int64

In [54]:
customer_newer.groupby("campaign_name").count()["customer_id"]

campaign_name
0_입회비반액할인     311
1_입회비무료       242
2_일반         2400
Name: customer_id, dtype: int64

In [55]:
customer_newer.groupby("gender").count()["customer_id"]

gender
F    1400
M    1553
Name: customer_id, dtype: int64

## 이용이력 데이터를 집계하자

In [93]:
# 월 이용 횟수의 평균값, 중앙값, 최댓값, 최소값과 정기적 이용여부를 플래그로 작성해서
# 고객 데이터에 추가

In [94]:
# 고객마다 월 이용 횟수를 집계한 데이터를 작성

In [86]:
uselog["usedate"] = pd.to_datetime(uselog["usedate"])

In [87]:
uselog

                 log_id customer_id    usedate
0       L00000049012330    AS009373 2018-04-01
1       L00000049012331    AS015315 2018-04-01
2       L00000049012332    AS040841 2018-04-01
3       L00000049012333    AS046594 2018-04-01
4       L00000049012334    AS073285 2018-04-01
...                 ...         ...        ...
197423  L00000049209753    TS977703 2019-03-31
197424  L00000049209754    TS979550 2019-03-31
197425  L00000049209755    TS995299 2019-03-31
197426  L00000049209756    TS995853 2019-03-31
197427  L00000049209757    TS999079 2019-03-31

[197428 rows x 3 columns]

In [88]:
uselog.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 197428 entries, 0 to 197427
Data columns (total 3 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   log_id       197428 non-null  object
 1   customer_id  197428 non-null  object
 2   usedate      197428 non-null  datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 4.5+ MB

In [89]:
uselog["연월"] = uselog["usedate"].dt.strftime("%Y%m")

In [90]:
uselog

                 log_id customer_id    usedate      연월
0       L00000049012330    AS009373 2018-04-01  201804
1       L00000049012331    AS015315 2018-04-01  201804
2       L00000049012332    AS040841 2018-04-01  201804
3       L00000049012333    AS046594 2018-04-01  201804
4       L00000049012334    AS073285 2018-04-01  201804
...                 ...         ...        ...     ...
197423  L00000049209753    TS977703 2019-03-31  201903
197424  L00000049209754    TS979550 2019-03-31  201903
197425  L00000049209755    TS995299 2019-03-31  201903
197426  L00000049209756    TS995853 2019-03-31  201903
197427  L00000049209757    TS999079 2019-03-31  201903

[197428 rows x 4 columns]

In [91]:
uselog_months = uselog.groupby(["연월","customer_id"],as_index=False).count()

In [92]:
uselog_months

           연월 customer_id  log_id  usedate
0      201804    AS002855       4        4
1      201804    AS009013       2        2
2      201804    AS009373       3        3
3      201804    AS015315       6        6
4      201804    AS015739       7        7
...       ...         ...     ...      ...
36837  201903    TS995853       8        8
36838  201903    TS998593       8        8
36839  201903    TS999079       3        3
36840  201903    TS999231       6        6
36841  201903    TS999855       4        4

[36842 rows x 4 columns]

In [95]:
uselog_months.rename(columns={"log_id":"count"}, inplace=True)

In [96]:
uselog_months

           연월 customer_id  count  usedate
0      201804    AS002855      4        4
1      201804    AS009013      2        2
2      201804    AS009373      3        3
3      201804    AS015315      6        6
4      201804    AS015739      7        7
...       ...         ...    ...      ...
36837  201903    TS995853      8        8
36838  201903    TS998593      8        8
36839  201903    TS999079      3        3
36840  201903    TS999231      6        6
36841  201903    TS999855      4        4

[36842 rows x 4 columns]

In [97]:
del uselog_months["usedate"]

In [98]:
uselog_months.head()

       연월 customer_id  count
0  201804    AS002855      4
1  201804    AS009013      2
2  201804    AS009373      3
3  201804    AS015315      6
4  201804    AS015739      7

In [99]:
uselog_months.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 36842 entries, 0 to 36841
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   연월           36842 non-null  object
 1   customer_id  36842 non-null  object
 2   count        36842 non-null  int64
dtypes: int64(1), object(2)
memory usage: 863.6+ KB

In [103]:
uselog_months['연월']

0        201804
1        201804
2        201804
3        201804
4        201804
          ...
36837    201903
36838    201903
36839    201903
36840    201903
36841    201903
Name: 연월, Length: 36842, dtype: object

In [ ]:
# 수치형으로 변환하기: 우선, object 타입의 데이터를 수치형 데이터로 변환해야 합니다.

In [81]:
# 변환 후 그룹화 및 집계하기: pd.to_numeric을 사용하여 열을 수치형으로 변환한 후에 그룹화와 집계를 수행합니다.